Repository: mrEDitor/gnome-shell-extension-scroll-panel
Catalog: locales/*.po
Languages: tr

source: Homepage: <a href="%1$s">%1$s</a>
tr: Anasayfa: <a href="%1$s">%1$s</a>

source: Seems like you are using unlocalized extension, would you like to <a href="%s">localize it</a>?
tr: Leave your suggestions and localizations on the project page!

source: About
tr: Hakkında

source: Switching workspaces
tr: Çalışma alanları arasında geçiş

source: Switching windows
tr: Pencereler arasında geçiş

source: Choose a feature to configure above.
tr: Yukarıdan ayarlamak istediğiniz özellik seçin.

source: Panel to scroll
tr: Panelde kaydırma

source: Choose a panel to scroll for the selected action. If the extension is enabled, the current choice is outlined in a colored box while the mouse pointer is over the button. Yellow box means that the highlighted panel currently does not have any event listeners and may be inaccessible because of other actors rendered over it. Use scrolling when picking an actor to choose hierarchy level, such as the whole bar instead of the clock box only.
tr: Seçilen eylem için kaydırılacak bir panel seçin. Uzantı etkinleştirilirse,fare işaretçisi düğmenin üzerindeyken geçerli seçim renkli bir kutuda özetlenir.Sarı kutu, vurgulanan panelin şu anda herhangi bir olay dinleyicisine sahip olmadığıve üzerinde oluşturulan diğer aktörler nedeniyle erişilemeyebileceği anlamına gelir.Yalnızca saat kutusu yerine tüm çubuk gibi hiyerarşi düzeyini seçmek için bir aktörseçerken kaydırmayı kullanın.

source: Panel fixed width
tr: Sabit panel genişliği

source: Set fixed width for the scrollable panel.
tr: Kaydırma alanının genişliğini sabitlemek için.

source: Panel content align
tr: Panel içeriğini Hızala

source: Set content align for the scrollable panel.
tr: Kaydırılabilir panel içeriğini hizalamak için.

source: System
tr: Sistem

source: Start
tr: Başlangıç

source: Center
tr: Merkez

source: End
tr: Son

source: Horizontal scrolling
tr: Dikey kaydırma

source: Whether horizontal scrolling should cause forward or back step.
tr: Yatay kaydırma davranışları

source: Off
tr: Kapalı

source: Direct
tr: Direkt

source: Inverted
tr: Ters

source: Vertical scrolling
tr: Yatay kaydırma

source: Whether vertical scrolling should cause forward or back step.
tr: Dikey kaydırma davranışları

source: Switching timeout
tr: Geçişler arası zaman aşımı

source: Timeout for switching event: further scrolling events in this timeout will be ignored.
tr: Bir aksiyon sonrasıda ki bekleme süresi. Bu süre sonuna kadar ki eylemleryok sayılacaktır.

source: Cyclic switching
tr: Döngüseleştir

source: Should the switcher cycle, i.e. switch between first and last elements when switching out-of-list.
tr: Sonsuz döngüyü sağlar. Son kısımdan başa atlar.Veya sondan başa

source: Visualize
tr: Görselleştir

source: Should the switcher be shown because of the action.
tr: Önizleme penceresi bu ayar ile görüntülenir.

source: This extension allows switching between windows or workspaces by scrolling Gnome Shell topbar with mouse (both in overview and workspace modes).
tr: Bu eklenti, fare panel üzerinde iken fare tekerleği ile pencereler veçalışma alanları arasında kaydırarak gezinmeyi sağlar.(Genel bakış ve çalışma alanlarının ikisinde de çalışır.)
