Repository: mrEDitor/gnome-shell-extension-scroll-panel
Catalog: locale/*.po
Languages: ru

source: This extension allows switching between windows or workspaces by scrolling Gnome Shell topbar with mouse (both in overview and workspace modes).
ru: Расширение позволяет переключаться между окнами или рабочими местами путём прокрутки верхней панели Gnome Shell колесиком мыши (как в режиме обзора, так и при работе).

source: by <a href="%s">Eduard Minasyan</a>
ru: Автор: <a href="%s">Эдуард Минасян</a>

source: Homepage: <a href="%1$s">%1$s</a>
ru: Домашняя страница: <a href="%1$s">%1$s</a>

source: Seems like you are using unlocalized extension, would you like to <a href="%s">localize it</a>?
ru: Оставляйте свои предложения по доработке и локализации на странице проекта!

source: Reset settings
ru: Сбросить настройки

source: About
ru: О расширении

source: Panel to scroll
ru: Панель для прокрутки

source: Choose a panel to scroll for the selected action. If the extension is enabled, the current choice is outlined in a colored box while the mouse pointer is over the button.
ru: Выберите панель, которая будет выполнять настраиваемое действие при прокрутке. Если расширение активно, текущая выбранная панель будет обведена цветной рамкой, пока указатель мыши находится на кнопке выбора.

source: Use scrolling when picking an actor to choose hierarchy level, such as the whole bar instead of the clock box only. Yellow box means that the highlighted panel currently does not have any event listeners and may be inaccessible because of other actors rendered over it.
ru: Для изменения уровня иерархии во время выбора панели (например, выбора между часами и всей панелью) используйте прокрутку. Жёлтая рамка показывает, что выбранная панель ещё не имеет обработчиков событий и может быть недоступной для прокрутки, если поверх неё отрисованы другие элементы интерфейса.

source: Panel fixed width
ru: Фиксированная ширина панели

source: Set fixed width for the scrollable panel.
ru: Фиксированная ширина, до которой будет расширена выбранная панель.

source: Panel content align
ru: Выравнивание содержимого панели

source: Set content align for the scrollable panel.
ru: Устанавливает режим выравнивания содержимого внутри выбранной панели.

source: System
ru: Системное

source: Start
ru: С начала

source: Center
ru: По центру

source: End
ru: С конца

source: Horizontal scrolling
ru: Горизонтальная прокрутка

source: Whether horizontal scrolling should cause forward or back step.
ru: Должна ли горизонтальная прокрутка восприниматься как переключение вперёд или назад.

source: Off
ru: Отключена

source: Direct
ru: Прямая

source: Inverted
ru: Обратная

source: Vertical scrolling
ru: Вертикальная прокрутка

source: Whether vertical scrolling should cause forward or back step.
ru: Должна ли вертикальная прокрутка восприниматься как переключение вперёд или назад.

source: Switching timeout
ru: Задержка следующего переключения

source: Timeout for switching event: further scrolling events in this timeout will be ignored.
ru: Задержка следующего переключения: до её истечения последующие события прокрутки будут проигнорированы.

source: Cyclic switching
ru: Циклическая прокрутка

source: Should the switcher cycle, i.e. switch between first and last elements when switching out-of-list.
ru: Должна ли прокрутка зацикливаться, т.е. переключаться между первым и последним элементами при выходе за границы списка элементов.

source: Visualize
ru: Визуализация

source: Should the switcher be shown because of the action.
ru: Должно ли действие быть визуализировано всплывающим переключателем.

source: Switching workspaces
ru: Переключение рабочих мест

source: Switching windows
ru: Переключение окон
